{"backend": "tensorflow", "config": [{"config": {"dtype": "float32", "trainable": true, "batch_input_shape": [null, 3, 11], "name": "masking_1", "mask_value": -1}, "class_name": "Masking"}, {"config": {"bias_constraint": null, "trainable": true, "bias_regularizer": null, "name": "lstm_1", "return_state": false, "recurrent_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "go_backwards": false, "dropout": 0.2, "unroll": false, "units": 32, "return_sequences": false, "implementation": 1, "activation": "tanh", "activity_regularizer": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "trainable": true, "bias_regularizer": null, "name": "dense_1", "units": 6, "batch_input_shape": [null, 32], "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "dtype": "float32", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.2.2"}